package awdse;

public class aritmetiksel_operatör {
	public static void main (String [] args) {
		int i = 10 ; //00000000 00000000 00000000 00001010
		int x = 4 ;  //00000000 00000000 00000000 00000100
					 //00000000 00000000 00000000 00001110
		System.out.println(~i); //11111111 11111111 11111111 11110101
		System.out.println(i & x); // 0 & 0 = 0
								   // 0 & 1 = 0
								   // 1 & 1 = 1
	//------------------------------------------------------------------//	
		System.out.println(i | x); // 0 | 0 = 0
								   // 0 | 0 = 0
								   // 0 | 1 = 1
								   // 1 | 1 = 1
	//------------------------------------------------------------------//
		System.out.println(x << 1 ); //00000000 00000000 00000000 00001000 sola kaydırır yani ikiyle çarpar
	//------------------------------------------------------------------//
		System.out.println(x >> 1 ); //00000000 00000000 00000000 00000010 sağa kaydırır yani ikiye böler
	}	
}
